Постоје две врсте домаћих задатака:

Пројекат
Мали задаци
Мали задаци се дају свакодневно, и предају се на следећи начин:

Средом до 20ч се предаје домаћи од понедељка и уторка
Недељом до 17ч се предаје домаћи од четвртка и петка
Пројектни задатак се даје у првој,четвртој и шестој недељи курса:

Мали задаци за ту недељу ће бити лакши (и моћи ће брже да се ураде)
Пројекат се добија у суботу увече и предаје се до следеће недеље у 18ч (У првој недељи ћете добити пројекат у среду)
Решења задатака:

Решења ће бити окачена на овој страници (https://github.com/peranovicc/ITBootcamp-Domaci)
Решења ће бити окачена након што сви предају свој домаћи (а најкасније 2 дана по окончању рока за предају)
Сврха домаћих задатака:

Мали задаци: Тестирање постојећих знања, самостално писање кода, брже усвајање градива
Пројекти: Све као мали задаци + додавање нових знања, самостално истраживање, попуњавање портфолија
Кашњење са предајом домаћих задатака:

Прво кашњење: суспензија 1 дан (до 18ч се мора предати домаћи)
Нпр. Нисте предали домаћи у среду до 18ч, у четвртак не долазите на наставу, предајете домаћи до 18ч у четвртак
